aula04/aula04.org
#+OPTIONS: num:nil toc:nil
#+OPTIONS: date:nil reveal_mathjax:t
#+OPTIONS: tex t
#+OPTIONS: timestamp:nil
#+OPTIONS: org-confirm-babel-evaluate nil
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 1
#+REVEAL_ROOT: file:///home/rodrigo/reveal.js

#+Title: Monad Transformers
#+Author: Construção de compiladores I

* Objetivos

** Objetivos

- Apresentar o conceito de Monad Transformer para combinar diferentes
  efeitos colaterais em um programa.

- Uso de monad transformers para permitir a manipulação de diretórios no
  compilador de markdown.

* Markdown

** Markdown

- Iniciamos nosso curso com o projeto de um mini-compilador de Markdown.

- Objetivo: revisar conceitos da linguagem Haskell

** Markdown

- Na última aula, finalizamos uma versão que processa apenas um único arquivo.
 
- Nesta aula estenderemos esse compilador com:
  - Processamento de diretórios
  - Incluir folhas de estilo nos html gerados.

** Markdown

- Estender o compilador para processar diretórios é uma tarefa bem direta.

** Markdown

- Incluir folhas de estilo
  - Tarefa simples, mas que leva a código longe do ideal.
  - Mostraremos como melhorar o código combinando mônadas.

* Processando diretórios

** Processando diretórios

- Para permitir processar todos os arquivos em um diretório, devemos modificar a interação por consoles.

** Processando diretórios

- Modificação do tipo de opções de entrada.

#+begin_src haskell
data Options
  = Single Input Output
  | Directory FilePath FilePath
  deriving Show
#+end_src

** Processando diretórios

- Modificação do parser

#+begin_src haskell
pOptions :: Parser Options
pOptions
  = subparser (singleParser <> directoryParser)
    where
      singleParser
        = command "file"
                  (info (helper <*> pSingle)
                        (progDesc "Convert a single markdown file to HTML"))
      directoryParser
        = command "directory"
                  (info (helper <*> pDirectory)
                        (progDesc "Convert all directory md files to HTML"))
#+end_src


** Processando diretórios

- Parser de diretórios

#+begin_src haskell
pDirectory :: Parser Options
pDirectory =
  Directory <$> pInputDir <*> pOutputDir
#+end_src

** Processando diretórios

- Parser de diretório de entrada

#+begin_src haskell
pInputDir :: Parser FilePath
pInputDir =
  strOption
    ( long "input"
      <> short 'i'
      <> metavar "DIRECTORY"
      <> help "Input directory"
    )
#+end_src

** Processando diretórios

- Processamento de diretórios de saída é similar.

** Processando diretórios

- Mudanças no pipeline de compilação.

#+begin_src haskell
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          filePipeline False inp out
        Directory inpDir outDir ->
          directoryPipeline inpDir outDir
#+end_src

