aula04/aula04.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Monad Transformers</title>
<meta name="author" content="Construção de compiladores I"/>
<link rel="stylesheet" href="file:///home/rodrigo/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="file:///home/rodrigo/reveal.js/dist/theme/white.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Monad Transformers</h1><h2 class="author">Construção de compiladores I</h2>
</section>

<section>
<section id="slide-org2a6c65a">
<h2 id="org2a6c65a">Objetivos</h2>
<div class="outline-text-2" id="text-org2a6c65a">
</div>
</section>
<section id="slide-org88f3f31">
<h3 id="org88f3f31">Objetivos</h3>
<ul>
<li>Apresentar o conceito de Monad Transformer para combinar diferentes
efeitos colaterais em um programa.</li>

<li>Uso de monad transformers para permitir a manipulação de diretórios no
compilador de markdown.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgffaea5c">
<h2 id="orgffaea5c">Markdown</h2>
<div class="outline-text-2" id="text-orgffaea5c">
</div>
</section>
<section id="slide-org3872310">
<h3 id="org3872310">Markdown</h3>
<ul>
<li>Iniciamos nosso curso com o projeto de um mini-compilador de Markdown.</li>

<li>Objetivo: revisar conceitos da linguagem Haskell</li>

</ul>

</section>
<section id="slide-orgca31fb5">
<h3 id="orgca31fb5">Markdown</h3>
<ul>
<li>Na última aula, finalizamos uma versão que processa apenas um único arquivo.</li>

<li>Nesta aula estenderemos esse compilador com:
<ul>
<li>Processamento de diretórios</li>
<li>Incluir folhas de estilo nos html gerados.</li>

</ul></li>

</ul>

</section>
<section id="slide-org6ef754e">
<h3 id="org6ef754e">Markdown</h3>
<ul>
<li>Estender o compilador para processar diretórios é uma tarefa bem direta.</li>

</ul>

</section>
<section id="slide-org402d214">
<h3 id="org402d214">Markdown</h3>
<ul>
<li>Incluir folhas de estilo
<ul>
<li>Tarefa simples, mas que leva a código longe do ideal.</li>
<li>Mostraremos como melhorar o código combinando mônadas.</li>

</ul></li>

</ul>

</section>
</section>
<section>
<section id="slide-org46c2172">
<h2 id="org46c2172">Processando diretórios</h2>
<div class="outline-text-2" id="text-org46c2172">
</div>
</section>
<section id="slide-org6a8d0b4">
<h3 id="org6a8d0b4">Processando diretórios</h3>
<ul>
<li>Para permitir processar todos os arquivos em um diretório, devemos modificar a interação por consoles.</li>

</ul>

</section>
<section id="slide-org196849f">
<h3 id="org196849f">Processando diretórios</h3>
<ul>
<li>Modificação do tipo de opções de entrada.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Options</span>
  <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Single</span> <span style="color: #ce537a; font-weight: bold;">Input</span> <span style="color: #ce537a; font-weight: bold;">Output</span>
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Directory</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span>
  <span style="color: #4f97d7; font-weight: bold;">deriving</span> <span style="color: #ce537a; font-weight: bold;">Show</span>
</pre>
</div>

</section>
<section id="slide-org3ad8a25">
<h3 id="org3ad8a25">Processando diretórios</h3>
<ul>
<li>Modificação do parser</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">pOptions</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Parser</span> <span style="color: #ce537a; font-weight: bold;">Options</span>
<span style="color: #bc6ec5; font-weight: bold;">pOptions</span>
  <span style="color: #7590db;">=</span> subparser <span style="color: #4f97d7;">(</span>singleParser <span style="color: #7590db;">&lt;&gt;</span> directoryParser<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">where</span>
      singleParser
        <span style="color: #7590db;">=</span> command <span style="color: #2d9574;">"file"</span>
                  <span style="color: #4f97d7;">(</span>info <span style="color: #bc6ec5;">(</span>helper <span style="color: #7590db;">&lt;*&gt;</span> pSingle<span style="color: #bc6ec5;">)</span>
                        <span style="color: #bc6ec5;">(</span>progDesc <span style="color: #2d9574;">"Convert a single markdown file to HTML"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
      directoryParser
        <span style="color: #7590db;">=</span> command <span style="color: #2d9574;">"directory"</span>
                  <span style="color: #4f97d7;">(</span>info <span style="color: #bc6ec5;">(</span>helper <span style="color: #7590db;">&lt;*&gt;</span> pDirectory<span style="color: #bc6ec5;">)</span>
                        <span style="color: #bc6ec5;">(</span>progDesc <span style="color: #2d9574;">"Convert all directory md files to HTML"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>


</section>
<section id="slide-orgbc7c1dd">
<h3 id="orgbc7c1dd">Processando diretórios</h3>
<ul>
<li>Parser de diretórios</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">pDirectory</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Parser</span> <span style="color: #ce537a; font-weight: bold;">Options</span>
<span style="color: #bc6ec5; font-weight: bold;">pDirectory</span> <span style="color: #7590db;">=</span>
  <span style="color: #ce537a; font-weight: bold;">Directory</span> <span style="color: #7590db;">&lt;$&gt;</span> pInputDir <span style="color: #7590db;">&lt;*&gt;</span> pOutputDir
</pre>
</div>

</section>
<section id="slide-org42e4031">
<h3 id="org42e4031">Processando diretórios</h3>
<ul>
<li>Parser de diretório de entrada</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">pInputDir</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Parser</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span>
<span style="color: #bc6ec5; font-weight: bold;">pInputDir</span> <span style="color: #7590db;">=</span>
  strOption
    <span style="color: #4f97d7;">(</span> long <span style="color: #2d9574;">"input"</span>
      <span style="color: #7590db;">&lt;&gt;</span> short <span style="color: #2d9574;">'i'</span>
      <span style="color: #7590db;">&lt;&gt;</span> metavar <span style="color: #2d9574;">"DIRECTORY"</span>
      <span style="color: #7590db;">&lt;&gt;</span> help <span style="color: #2d9574;">"Input directory"</span>
    <span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-org995fa4e">
<h3 id="org995fa4e">Processando diretórios</h3>
<ul>
<li>Processamento de diretórios de saída é similar.</li>

</ul>

</section>
<section id="slide-orgcac4538">
<h3 id="orgcac4538">Processando diretórios</h3>
<ul>
<li>Mudanças no pipeline de compilação.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">startPipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">startPipeline</span>
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      options <span style="color: #7590db;">&lt;-</span> optionsParser
      <span style="color: #4f97d7; font-weight: bold;">case</span> options <span style="color: #4f97d7; font-weight: bold;">of</span>
        <span style="color: #ce537a; font-weight: bold;">Single</span> inp out <span style="color: #7590db;">-&gt;</span>
          filePipeline <span style="color: #ce537a; font-weight: bold;">False</span> inp out
        <span style="color: #ce537a; font-weight: bold;">Directory</span> inpDir outDir <span style="color: #7590db;">-&gt;</span>
          directoryPipeline inpDir outDir
</pre>
</div>

</section>
