aula04/aula04.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Construção de compiladores I}
\date{}
\title{Monad Transformers}
\hypersetup{
 pdfauthor={Construção de compiladores I},
 pdftitle={Monad Transformers},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Objetivos}
\label{sec:org1bfeb9d}

\subsection*{Objetivos}
\label{sec:orgfca5cda}

\begin{itemize}
\item Apresentar o conceito de Monad Transformer para combinar diferentes
efeitos colaterais em um programa.

\item Uso de monad transformers para permitir a manipulação de diretórios no
compilador de markdown.
\end{itemize}
\section*{Markdown}
\label{sec:orgb96e407}

\subsection*{Markdown}
\label{sec:org6270bc1}

\begin{itemize}
\item Iniciamos nosso curso com o projeto de um mini-compilador de Markdown.

\item Objetivo: revisar conceitos da linguagem Haskell
\end{itemize}
\subsection*{Markdown}
\label{sec:org6efbc94}

\begin{itemize}
\item Na última aula, finalizamos uma versão que processa apenas um único arquivo.

\item Nesta aula estenderemos esse compilador com:
\begin{itemize}
\item Processamento de diretórios
\item Incluir folhas de estilo nos html gerados.
\end{itemize}
\end{itemize}
\subsection*{Markdown}
\label{sec:orgd680866}

\begin{itemize}
\item Estender o compilador para processar diretórios é uma tarefa bem direta.
\end{itemize}
\subsection*{Markdown}
\label{sec:org4e3ab71}

\begin{itemize}
\item Incluir folhas de estilo
\begin{itemize}
\item Tarefa simples, mas que leva a código longe do ideal.
\item Mostraremos como melhorar o código combinando mônadas.
\end{itemize}
\end{itemize}
\section*{Processando diretórios}
\label{sec:org31b1d4d}

\subsection*{Processando diretórios}
\label{sec:org3244b0f}

\begin{itemize}
\item Para permitir processar todos os arquivos em um diretório, devemos modificar a interação por consoles.
\end{itemize}
\subsection*{Processando diretórios}
\label{sec:orgd478255}

\begin{itemize}
\item Modificação do tipo de opções de entrada.
\end{itemize}

\begin{verbatim}
data Options
  = Single Input Output
  | Directory FilePath FilePath
  deriving Show
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:org5261a58}

\begin{itemize}
\item Modificação do parser
\end{itemize}

\begin{verbatim}
pOptions :: Parser Options
pOptions
  = subparser (singleParser <> directoryParser)
    where
      singleParser
        = command "file"
                  (info (helper <*> pSingle)
                        (progDesc "Convert a single markdown file to HTML"))
      directoryParser
        = command "directory"
                  (info (helper <*> pDirectory)
                        (progDesc "Convert all directory md files to HTML"))
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:org96790e4}

\begin{itemize}
\item Parser de diretórios
\end{itemize}

\begin{verbatim}
pDirectory :: Parser Options
pDirectory =
  Directory <$> pInputDir <*> pOutputDir
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:org1e0ca8f}

\begin{itemize}
\item Parser de diretório de entrada
\end{itemize}

\begin{verbatim}
pInputDir :: Parser FilePath
pInputDir =
  strOption
    ( long "input"
      <> short 'i'
      <> metavar "DIRECTORY"
      <> help "Input directory"
    )
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:org0973ba8}

\begin{itemize}
\item Processamento de diretórios de saída é similar.
\end{itemize}
\subsection*{Processando diretórios}
\label{sec:org894ad54}

\begin{itemize}
\item Mudanças no pipeline de compilação.
\end{itemize}

\begin{verbatim}
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          filePipeline False inp out
        Directory inpDir outDir ->
          directoryPipeline inpDir outDir
\end{verbatim}
