aula04/aula04.org
** Processando diretórios

- Modificações no pipeline de arquivos individuais

#+begin_src haskell
filePipeline :: Bool -> Input -> Output -> IO ()
filePipeline dirMode inpFile outFile 
  = do
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- createHandles inpFile outFile
      content <- hGetContents inpHandle
      res <- pipeline (title_ title) content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
#+end_src

** Processando diretórios

- Pipeline de diretórios

#+begin_src haskell
directoryPipeline :: FilePath -> FilePath -> IO ()
directoryPipeline inputDir outputDir
  = do
      d <- directoryContents inputDir
      let files = filesToCompile d
          otherFiles = filesToCopy d
      let entries = map (\ (i,o) -> (FileInput i, FileOutput o)) files
      shouldContinue <- createOutputDirectory outputDir
      unless shouldContinue (hPutStrLn stderr "Cancelled." *> exitFailure)
      mapM_ (uncurry (filePipeline True)) entries
      let copy file = copyFile file (outputDir </> takeFileName file)
      mapM_ copy otherFiles
      putStrLn "Done."
#+end_src

** Processando diretórios

- Código contendo exatamente essas modificações pode ser encontrado na branch ~markup-directories~.

* Adicionando estilos

** Adicionando estilos

- Até o presente momento, não usamos folhas de estilo para formatar o HTML gerado.

- Como adicionar folhas de estilo?

** Adicionando estilos

- Definido um tipo para armazenar o caminho de folhas de estilo

#+begin_src haskell
data Env
  = Env {
      stylePath :: FilePath
    } deriving Show

defaultEnv :: Env
defaultEnv = Env ""
#+end_src

** Adicionando estilos

- Agora, temos que modificar todo o código para permitir este parâmetro adicional.

** Adicionando estilos

- Adicionando tags para estilos na EDSL de HTML

#+begin_src haskell
stylesheet_ :: FilePath -> Head
stylesheet_ path =
    Head $ "<link rel=\"stylesheet\" type=\"text/css\" href=\"" <>
            escape path <> "\">"
#+end_src

** Adicionando estilos

- Modificando o parser de diretórios para entrada

#+begin_src haskell
data Options
  = Single Input Output
  | Directory FilePath FilePath Env 
  deriving Show
#+end_src


** Adicionando estilos

- Modificando o parser de diretórios para entrada

#+begin_src haskell
pDirectory :: Parser Options
pDirectory =
  Directory <$> pInputDir <*> pOutputDir <*> pEnv
#+end_src


