aula04/aula04.html
<section id="slide-orgde5513f">
<h3 id="orgde5513f">Processando diretórios</h3>
<ul>
<li>Modificações no pipeline de arquivos individuais</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">filePipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Input</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Output</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">filePipeline</span> dirMode inpFile outFile 
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      progressMessage dirMode inpFile
      <span style="color: #4f97d7;">(</span>title,inpHandle,outHandle<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&lt;-</span> createHandles inpFile outFile
      content <span style="color: #7590db;">&lt;-</span> hGetContents inpHandle
      res <span style="color: #7590db;">&lt;-</span> pipeline <span style="color: #4f97d7;">(</span>title_ title<span style="color: #4f97d7;">)</span> content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
</pre>
</div>

</section>
<section id="slide-org0578be9">
<h3 id="org0578be9">Processando diretórios</h3>
<ul>
<li>Pipeline de diretórios</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">directoryPipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">directoryPipeline</span> inputDir outputDir
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      d <span style="color: #7590db;">&lt;-</span> directoryContents inputDir
      <span style="color: #4f97d7; font-weight: bold;">let</span> files <span style="color: #7590db;">=</span> filesToCompile d
          otherFiles <span style="color: #7590db;">=</span> filesToCopy d
      <span style="color: #4f97d7; font-weight: bold;">let</span> entries <span style="color: #7590db;">=</span> map <span style="color: #4f97d7;">(</span><span style="color: #7590db;">\</span> <span style="color: #bc6ec5;">(</span>i,o<span style="color: #bc6ec5;">)</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">FileInput</span> i, <span style="color: #ce537a; font-weight: bold;">FileOutput</span> o<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> files
      shouldContinue <span style="color: #7590db;">&lt;-</span> createOutputDirectory outputDir
      unless shouldContinue <span style="color: #4f97d7;">(</span>hPutStrLn stderr <span style="color: #2d9574;">"Cancelled."</span> <span style="color: #7590db;">*&gt;</span> exitFailure<span style="color: #4f97d7;">)</span>
      mapM_ <span style="color: #4f97d7;">(</span>uncurry <span style="color: #bc6ec5;">(</span>filePipeline <span style="color: #ce537a; font-weight: bold;">True</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> entries
      <span style="color: #4f97d7; font-weight: bold;">let</span> copy file <span style="color: #7590db;">=</span> copyFile file <span style="color: #4f97d7;">(</span>outputDir <span style="color: #7590db;">&lt;/&gt;</span> takeFileName file<span style="color: #4f97d7;">)</span>
      mapM_ copy otherFiles
      putStrLn <span style="color: #2d9574;">"Done."</span>
</pre>
</div>

</section>
<section id="slide-org9993e75">
<h3 id="org9993e75">Processando diretórios</h3>
<ul>
<li>Código contendo exatamente essas modificações pode ser encontrado na branch <code>markup-directories</code>.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org7528622">
<h2 id="org7528622">Adicionando estilos</h2>
<div class="outline-text-2" id="text-org7528622">
</div>
</section>
<section id="slide-orgecb6848">
<h3 id="orgecb6848">Adicionando estilos</h3>
<ul>
<li>Até o presente momento, não usamos folhas de estilo para formatar o HTML gerado.</li>

<li>Como adicionar folhas de estilo?</li>

</ul>

</section>
<section id="slide-org759f00c">
<h3 id="org759f00c">Adicionando estilos</h3>
<ul>
<li>Definido um tipo para armazenar o caminho de folhas de estilo</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Env</span>
  <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #4f97d7;">{</span>
      stylePath <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span>
    <span style="color: #4f97d7;">}</span> <span style="color: #4f97d7; font-weight: bold;">deriving</span> <span style="color: #ce537a; font-weight: bold;">Show</span>

<span style="color: #bc6ec5; font-weight: bold;">defaultEnv</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Env</span>
<span style="color: #bc6ec5; font-weight: bold;">defaultEnv</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #2d9574;">""</span>
</pre>
</div>

</section>
<section id="slide-org153d38c">
<h3 id="org153d38c">Adicionando estilos</h3>
<ul>
<li>Agora, temos que modificar todo o código para permitir este parâmetro adicional.</li>

</ul>

</section>
<section id="slide-org54e9a8d">
<h3 id="org54e9a8d">Adicionando estilos</h3>
<ul>
<li>Adicionando tags para estilos na EDSL de HTML</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">stylesheet_</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Head</span>
<span style="color: #bc6ec5; font-weight: bold;">stylesheet_</span> path <span style="color: #7590db;">=</span>
    <span style="color: #ce537a; font-weight: bold;">Head</span> <span style="color: #7590db;">$</span> <span style="color: #2d9574;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\""</span> <span style="color: #7590db;">&lt;&gt;</span>
            escape path <span style="color: #7590db;">&lt;&gt;</span> <span style="color: #2d9574;">"\"&gt;"</span>
</pre>
</div>

</section>
<section id="slide-org504e8f6">
<h3 id="org504e8f6">Adicionando estilos</h3>
<ul>
<li>Modificando o parser de diretórios para entrada</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Options</span>
  <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Single</span> <span style="color: #ce537a; font-weight: bold;">Input</span> <span style="color: #ce537a; font-weight: bold;">Output</span>
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Directory</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #ce537a; font-weight: bold;">FilePath</span> <span style="color: #ce537a; font-weight: bold;">Env</span> 
  <span style="color: #4f97d7; font-weight: bold;">deriving</span> <span style="color: #ce537a; font-weight: bold;">Show</span>
</pre>
</div>


</section>
<section id="slide-org019179e">
<h3 id="org019179e">Adicionando estilos</h3>
<ul>
<li>Modificando o parser de diretórios para entrada</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">pDirectory</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Parser</span> <span style="color: #ce537a; font-weight: bold;">Options</span>
<span style="color: #bc6ec5; font-weight: bold;">pDirectory</span> <span style="color: #7590db;">=</span>
  <span style="color: #ce537a; font-weight: bold;">Directory</span> <span style="color: #7590db;">&lt;$&gt;</span> pInputDir <span style="color: #7590db;">&lt;*&gt;</span> pOutputDir <span style="color: #7590db;">&lt;*&gt;</span> pEnv
</pre>
</div>


</section>
