aula04/aula04.tex
\subsection*{Processando diretórios}
\label{sec:orge85774f}

\begin{itemize}
\item Modificações no pipeline de arquivos individuais
\end{itemize}

\begin{verbatim}
filePipeline :: Bool -> Input -> Output -> IO ()
filePipeline dirMode inpFile outFile 
  = do
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- createHandles inpFile outFile
      content <- hGetContents inpHandle
      res <- pipeline (title_ title) content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:org9256d4b}

\begin{itemize}
\item Pipeline de diretórios
\end{itemize}

\begin{verbatim}
directoryPipeline :: FilePath -> FilePath -> IO ()
directoryPipeline inputDir outputDir
  = do
      d <- directoryContents inputDir
      let files = filesToCompile d
          otherFiles = filesToCopy d
      let entries = map (\ (i,o) -> (FileInput i, FileOutput o)) files
      shouldContinue <- createOutputDirectory outputDir
      unless shouldContinue (hPutStrLn stderr "Cancelled." *> exitFailure)
      mapM_ (uncurry (filePipeline True)) entries
      let copy file = copyFile file (outputDir </> takeFileName file)
      mapM_ copy otherFiles
      putStrLn "Done."
\end{verbatim}
\subsection*{Processando diretórios}
\label{sec:orge1a0d90}

\begin{itemize}
\item Código contendo exatamente essas modificações pode ser encontrado na branch \texttt{markup-directories}.
\end{itemize}
\section*{Adicionando estilos}
\label{sec:org2394107}

\subsection*{Adicionando estilos}
\label{sec:org76588a5}

\begin{itemize}
\item Até o presente momento, não usamos folhas de estilo para formatar o HTML gerado.

\item Como adicionar folhas de estilo?
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:org470878c}

\begin{itemize}
\item Definido um tipo para armazenar o caminho de folhas de estilo
\end{itemize}

\begin{verbatim}
data Env
  = Env {
      stylePath :: FilePath
    } deriving Show

defaultEnv :: Env
defaultEnv = Env ""
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:orgfe3e968}

\begin{itemize}
\item Agora, temos que modificar todo o código para permitir este parâmetro adicional.
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:org4eb7be8}

\begin{itemize}
\item Adicionando tags para estilos na EDSL de HTML
\end{itemize}

\begin{verbatim}
stylesheet_ :: FilePath -> Head
stylesheet_ path =
    Head $ "<link rel=\"stylesheet\" type=\"text/css\" href=\"" <>
            escape path <> "\">"
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:orgf81373c}

\begin{itemize}
\item Modificando o parser de diretórios para entrada
\end{itemize}

\begin{verbatim}
data Options
  = Single Input Output
  | Directory FilePath FilePath Env 
  deriving Show
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:org230c5b9}

\begin{itemize}
\item Modificando o parser de diretórios para entrada
\end{itemize}

\begin{verbatim}
pDirectory :: Parser Options
pDirectory =
  Directory <$> pInputDir <*> pOutputDir <*> pEnv
\end{verbatim}
