aula04/aula04.org
** Adicionando estilos

- Modificando o parser de diretórios para entrada

#+begin_src haskell
pEnv :: Parser Env
pEnv = fromMaybe defaultEnv <$> optional p
  where
    p =  Env <$> strOption
                 (  long "style"
                 <> short 'S'
                 <> metavar "FILE"
                 <> help "Stylesheet filename"
                 )
#+end_src

** Adicionando estilos

- Modificando o pipeline de compilação
  - Inclusão do environment em *TODAS* as funções do pipeline.

#+begin_src haskell
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          filePipeline False defaultEnv inp out
        Directory inpDir outDir env ->
          directoryPipeline env inpDir outDir
#+end_src

** Adicionando estilos

- Modificando o pipeline de compilação.
  - Estilos usados apenas em ~filePipeline~.
  - Demais funções apenas "passam" o valor de ~Env~.

#+begin_src haskell
filePipeline :: Bool -> Env -> Input -> Output -> IO ()
filePipeline dirMode env inpFile outFile 
  = do
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- createHandles inpFile outFile
      content <- hGetContents inpHandle
      let header = title_ title <> stylesheet_ (stylePath env) 
      res <- pipeline header content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
#+end_src

** Adicionando estilos

- Versão contendo o código com passagem explícita de ~Env~ está disponível
  na branch ~markup-explicit-env~.

** Adicionando estilos

- Essa passagem de valores é tediosa e propensa a erros.

- Ideal: Acessar o valor somente no ponto onde este será utilizado.
  - Garantir que esse valor não será modificado.

** Adicionando estilos

- Podemos garantir a situação ideal utilizando a mônada de somente leitura
  - Reader
- Como combinar essa mônada com a mônada de IO?

** Adicionando estilos

- Para isso, devemos utilizar *transformadores monádicos*.
  - Permitem combinar a funcionalidade de diferentes mônadas.

** Adicionando estilos

- Principal função da mônada de somente leitura
  - Retorna o valor armazenado na mônada para consulta.

#+begin_src haskell
ask :: MonadReader m => m a
#+end_src

** Adicionando estilos

- Modificando o pipeline de compilação para usar a nova mônada

#+begin_src haskell
type CompilerM a = (ReaderT Env IO) a

runCompilerM :: Env -> CompilerM a -> IO a
runCompilerM env m = runReaderT m env
#+end_src

** Adicionando estilos

- Modificando o início do pipeline

#+begin_src haskell
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          runCompilerM defaultEnv (filePipeline False inp out)
        Directory inpDir outDir env ->
          runCompilerM env (directoryPipeline inpDir outDir)
#+end_src

