aula04/aula04.html
<section id="slide-org1684c80">
<h3 id="org1684c80">Adicionando estilos</h3>
<ul>
<li>Modificando o parser de diretórios para entrada</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">pEnv</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Parser</span> <span style="color: #ce537a; font-weight: bold;">Env</span>
<span style="color: #bc6ec5; font-weight: bold;">pEnv</span> <span style="color: #7590db;">=</span> fromMaybe defaultEnv <span style="color: #7590db;">&lt;$&gt;</span> optional p
  <span style="color: #4f97d7; font-weight: bold;">where</span>
    p <span style="color: #7590db;">=</span>  <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #7590db;">&lt;$&gt;</span> strOption
                 <span style="color: #4f97d7;">(</span>  long <span style="color: #2d9574;">"style"</span>
                 <span style="color: #7590db;">&lt;&gt;</span> short <span style="color: #2d9574;">'S'</span>
                 <span style="color: #7590db;">&lt;&gt;</span> metavar <span style="color: #2d9574;">"FILE"</span>
                 <span style="color: #7590db;">&lt;&gt;</span> help <span style="color: #2d9574;">"Stylesheet filename"</span>
                 <span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-orgc0212c6">
<h3 id="orgc0212c6">Adicionando estilos</h3>
<ul>
<li>Modificando o pipeline de compilação
<ul>
<li>Inclusão do environment em <b>TODAS</b> as funções do pipeline.</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">startPipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">startPipeline</span>
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      options <span style="color: #7590db;">&lt;-</span> optionsParser
      <span style="color: #4f97d7; font-weight: bold;">case</span> options <span style="color: #4f97d7; font-weight: bold;">of</span>
        <span style="color: #ce537a; font-weight: bold;">Single</span> inp out <span style="color: #7590db;">-&gt;</span>
          filePipeline <span style="color: #ce537a; font-weight: bold;">False</span> defaultEnv inp out
        <span style="color: #ce537a; font-weight: bold;">Directory</span> inpDir outDir env <span style="color: #7590db;">-&gt;</span>
          directoryPipeline env inpDir outDir
</pre>
</div>

</section>
<section id="slide-org8a429e8">
<h3 id="org8a429e8">Adicionando estilos</h3>
<ul>
<li>Modificando o pipeline de compilação.
<ul>
<li>Estilos usados apenas em <code>filePipeline</code>.</li>
<li>Demais funções apenas "passam" o valor de <code>Env</code>.</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">filePipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Input</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Output</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">filePipeline</span> dirMode env inpFile outFile 
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      progressMessage dirMode inpFile
      <span style="color: #4f97d7;">(</span>title,inpHandle,outHandle<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&lt;-</span> createHandles inpFile outFile
      content <span style="color: #7590db;">&lt;-</span> hGetContents inpHandle
      <span style="color: #4f97d7; font-weight: bold;">let</span> header <span style="color: #7590db;">=</span> title_ title <span style="color: #7590db;">&lt;&gt;</span> stylesheet_ <span style="color: #4f97d7;">(</span>stylePath env<span style="color: #4f97d7;">)</span> 
      res <span style="color: #7590db;">&lt;-</span> pipeline header content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
</pre>
</div>

</section>
<section id="slide-org243492b">
<h3 id="org243492b">Adicionando estilos</h3>
<ul>
<li>Versão contendo o código com passagem explícita de <code>Env</code> está disponível
na branch <code>markup-explicit-env</code>.</li>

</ul>

</section>
<section id="slide-org213451f">
<h3 id="org213451f">Adicionando estilos</h3>
<ul>
<li>Essa passagem de valores é tediosa e propensa a erros.</li>

<li>Ideal: Acessar o valor somente no ponto onde este será utilizado.
<ul>
<li>Garantir que esse valor não será modificado.</li>

</ul></li>

</ul>

</section>
<section id="slide-org4b64685">
<h3 id="org4b64685">Adicionando estilos</h3>
<ul>
<li>Podemos garantir a situação ideal utilizando a mônada de somente leitura
<ul>
<li>Reader</li>

</ul></li>
<li>Como combinar essa mônada com a mônada de IO?</li>

</ul>

</section>
<section id="slide-orgebf4c64">
<h3 id="orgebf4c64">Adicionando estilos</h3>
<ul>
<li>Para isso, devemos utilizar <b>transformadores monádicos</b>.
<ul>
<li>Permitem combinar a funcionalidade de diferentes mônadas.</li>

</ul></li>

</ul>

</section>
<section id="slide-org3f92968">
<h3 id="org3f92968">Adicionando estilos</h3>
<ul>
<li>Principal função da mônada de somente leitura
<ul>
<li>Retorna o valor armazenado na mônada para consulta.</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">ask</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">MonadReader</span> m <span style="color: #7590db;">=&gt;</span> m a
</pre>
</div>

</section>
<section id="slide-org35b1442">
<h3 id="org35b1442">Adicionando estilos</h3>
<ul>
<li>Modificando o pipeline de compilação para usar a nova mônada</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">CompilerM</span> a <span style="color: #7590db;">=</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ReaderT</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #ce537a; font-weight: bold;">IO</span><span style="color: #4f97d7;">)</span> a

<span style="color: #bc6ec5; font-weight: bold;">runCompilerM</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">CompilerM</span> a <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">IO</span> a
<span style="color: #bc6ec5; font-weight: bold;">runCompilerM</span> env m <span style="color: #7590db;">=</span> runReaderT m env
</pre>
</div>

</section>
<section id="slide-orge304bdb">
<h3 id="orge304bdb">Adicionando estilos</h3>
<ul>
<li>Modificando o início do pipeline</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">startPipeline</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">startPipeline</span>
  <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      options <span style="color: #7590db;">&lt;-</span> optionsParser
      <span style="color: #4f97d7; font-weight: bold;">case</span> options <span style="color: #4f97d7; font-weight: bold;">of</span>
        <span style="color: #ce537a; font-weight: bold;">Single</span> inp out <span style="color: #7590db;">-&gt;</span>
          runCompilerM defaultEnv <span style="color: #4f97d7;">(</span>filePipeline <span style="color: #ce537a; font-weight: bold;">False</span> inp out<span style="color: #4f97d7;">)</span>
        <span style="color: #ce537a; font-weight: bold;">Directory</span> inpDir outDir env <span style="color: #7590db;">-&gt;</span>
          runCompilerM env <span style="color: #4f97d7;">(</span>directoryPipeline inpDir outDir<span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
