aula04/aula04.tex
\subsection*{Adicionando estilos}
\label{sec:org99c329b}

\begin{itemize}
\item Modificando o parser de diretórios para entrada
\end{itemize}

\begin{verbatim}
pEnv :: Parser Env
pEnv = fromMaybe defaultEnv <$> optional p
  where
    p =  Env <$> strOption
                 (  long "style"
                 <> short 'S'
                 <> metavar "FILE"
                 <> help "Stylesheet filename"
                 )
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:org7aa5503}

\begin{itemize}
\item Modificando o pipeline de compilação
\begin{itemize}
\item Inclusão do environment em \textbf{TODAS} as funções do pipeline.
\end{itemize}
\end{itemize}

\begin{verbatim}
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          filePipeline False defaultEnv inp out
        Directory inpDir outDir env ->
          directoryPipeline env inpDir outDir
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:org12bad17}

\begin{itemize}
\item Modificando o pipeline de compilação.
\begin{itemize}
\item Estilos usados apenas em \texttt{filePipeline}.
\item Demais funções apenas ``passam'' o valor de \texttt{Env}.
\end{itemize}
\end{itemize}

\begin{verbatim}
filePipeline :: Bool -> Env -> Input -> Output -> IO ()
filePipeline dirMode env inpFile outFile 
  = do
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- createHandles inpFile outFile
      content <- hGetContents inpHandle
      let header = title_ title <> stylesheet_ (stylePath env) 
      res <- pipeline header content
      hPutStrLn outHandle res
      hClose inpHandle
      hClose outHandle
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:orge904aa9}

\begin{itemize}
\item Versão contendo o código com passagem explícita de \texttt{Env} está disponível
na branch \texttt{markup-explicit-env}.
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:orgc34c931}

\begin{itemize}
\item Essa passagem de valores é tediosa e propensa a erros.

\item Ideal: Acessar o valor somente no ponto onde este será utilizado.
\begin{itemize}
\item Garantir que esse valor não será modificado.
\end{itemize}
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:orgba08e83}

\begin{itemize}
\item Podemos garantir a situação ideal utilizando a mônada de somente leitura
\begin{itemize}
\item Reader
\end{itemize}
\item Como combinar essa mônada com a mônada de IO?
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:orgd8ba349}

\begin{itemize}
\item Para isso, devemos utilizar \textbf{transformadores monádicos}.
\begin{itemize}
\item Permitem combinar a funcionalidade de diferentes mônadas.
\end{itemize}
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:org188357f}

\begin{itemize}
\item Principal função da mônada de somente leitura
\begin{itemize}
\item Retorna o valor armazenado na mônada para consulta.
\end{itemize}
\end{itemize}

\begin{verbatim}
ask :: MonadReader m => m a
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:org869b588}

\begin{itemize}
\item Modificando o pipeline de compilação para usar a nova mônada
\end{itemize}

\begin{verbatim}
type CompilerM a = (ReaderT Env IO) a

runCompilerM :: Env -> CompilerM a -> IO a
runCompilerM env m = runReaderT m env
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:org15290e9}

\begin{itemize}
\item Modificando o início do pipeline
\end{itemize}

\begin{verbatim}
startPipeline :: IO ()
startPipeline
  = do
      options <- optionsParser
      case options of
        Single inp out ->
          runCompilerM defaultEnv (filePipeline False inp out)
        Directory inpDir outDir env ->
          runCompilerM env (directoryPipeline inpDir outDir)
\end{verbatim}
