aula04/aula04.org
** Adicionando estilos

- Modificando o pipeline de arquivos individuais
  - Uso da função ~ask~

#+begin_src haskell
filePipeline :: Bool -> Input -> Output -> CompilerM ()
filePipeline dirMode inpFile outFile 
  = do
      env <- ask
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- liftIO $ createHandles inpFile outFile
      content <- liftIO $ hGetContents inpHandle
      let header = title_ title <> stylesheet_ (stylePath env) 
      res <- pipeline header content
      writeAndCloseHandles res inpHandle outHandle
#+end_src

** Adicionando estilos

- Demais funções tiveram alterações pontuais
  - Modificação da assinatura de tipos
  - Uso de ~liftIO~.

** Adicionando estilos

- Código contendo essa versão está disponível na branch ~main~.

* Concluindo

** Concluindo

- Com isso, terminamos nossa revisão de Haskell.
- Produzimos um compilador de um subconjunto de Markdown para HTML.
  - Utilizamos várias bibliotecas úteis de Haskell.
  - Apresentamos o padrão functional core / imperative shell

** Concluindo

- Utilizamos monad transformers em um exemplo muito simples.

- Recomendo ver um exemplo um pouco mais interessante disponível no seguinte [[https://github.com/mgrabmueller/TransformersStepByStep][repositório]].

** Concluindo

- Próxima aula: iniciamos o primeiro tópico de compiladores
  - Análise léxica

* Exercícios

** Exercícios

- Em exercícios anteriores, você extendeu o compilador de Markdown para gerar slides beamer.
  - Modifique a versão atual para gerar slides para todos os arquivos em um diretório

** Exercícios

- Modifique o parser de argumentos de linha de comando para permitir a especificação do template de slides a ser usado como argumento de linha de comando.
   - [[https://latex-beamer.com/tutorials/beamer-themes/][Lista de templates disponíveis]].
- Entrega via Github classroom.
