aula04/aula04.tex
\subsection*{Adicionando estilos}
\label{sec:org190af6e}

\begin{itemize}
\item Modificando o pipeline de arquivos individuais
\begin{itemize}
\item Uso da função \texttt{ask}
\end{itemize}
\end{itemize}

\begin{verbatim}
filePipeline :: Bool -> Input -> Output -> CompilerM ()
filePipeline dirMode inpFile outFile 
  = do
      env <- ask
      progressMessage dirMode inpFile
      (title,inpHandle,outHandle) <- liftIO $ createHandles inpFile outFile
      content <- liftIO $ hGetContents inpHandle
      let header = title_ title <> stylesheet_ (stylePath env) 
      res <- pipeline header content
      writeAndCloseHandles res inpHandle outHandle
\end{verbatim}
\subsection*{Adicionando estilos}
\label{sec:orgeba9b3d}

\begin{itemize}
\item Demais funções tiveram alterações pontuais
\begin{itemize}
\item Modificação da assinatura de tipos
\item Uso de \texttt{liftIO}.
\end{itemize}
\end{itemize}
\subsection*{Adicionando estilos}
\label{sec:orgc3ff6f3}

\begin{itemize}
\item Código contendo essa versão está disponível na branch \texttt{main}.
\end{itemize}
\section*{Concluindo}
\label{sec:orgf6d7850}

\subsection*{Concluindo}
\label{sec:orgb27dd83}

\begin{itemize}
\item Com isso, terminamos nossa revisão de Haskell.
\item Produzimos um compilador de um subconjunto de Markdown para HTML.
\begin{itemize}
\item Utilizamos várias bibliotecas úteis de Haskell.
\item Apresentamos o padrão functional core / imperative shell
\end{itemize}
\end{itemize}
\subsection*{Concluindo}
\label{sec:org07b93cb}

\begin{itemize}
\item Utilizamos monad transformers em um exemplo muito simples.

\item Recomendo ver um exemplo um pouco mais interessante disponível no seguinte \href{https://github.com/mgrabmueller/TransformersStepByStep}{repositório}.
\end{itemize}
\subsection*{Concluindo}
\label{sec:org9a15193}

\begin{itemize}
\item Próxima aula: iniciamos o primeiro tópico de compiladores
\begin{itemize}
\item Análise léxica
\end{itemize}
\end{itemize}
\section*{Exercícios}
\label{sec:org7504a5b}

\subsection*{Exercícios}
\label{sec:org8963340}

\begin{itemize}
\item Em exercícios anteriores, você extendeu o compilador de Markdown para gerar slides beamer.
\begin{itemize}
\item Modifique a versão atual para gerar slides para todos os arquivos em um diretório
\end{itemize}
\end{itemize}
\subsection*{Exercícios}
\label{sec:org960fd16}

\begin{itemize}
\item Modifique o parser de argumentos de linha de comando para permitir a especificação do
template de slides a ser usado como argumento de linha de comando.
\begin{itemize}
\item \href{https://latex-beamer.com/tutorials/beamer-themes/}{Lista de templates disponíveis}.
\end{itemize}
\item Entrega via Github classroom.
\end{itemize}
\end{document}
